src/DataProcessors/ИС_АЛИ_ВыгрузкаКарточекТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_АЛИ_ВыгрузкаКарточекТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_АЛИ_СоответствиеЗначенийХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_АЛИ_СоответствиеЗначенийХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРеквизита1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_ВидРеквизитаСопоставления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реквизит1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АтрибутАли</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Атрибут</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеАтрибутаАли</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_ЗначенияАтрибутов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_Ozon_ВидРеквизитаСопоставления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_Ozon_ВидРеквизитаСопоставления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСвойствоНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШтрихкодНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ИС_АЛИ_ВыгрузкаКарточекТоваров/Forms/ФормаСопоставленияЗначений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Категория", Категория);
	Параметры.Свойство("АтрибутАли", АтрибутАли);
	Параметры.Свойство("ВидРеквизита1С", ВидРеквизита1С);
	Параметры.Свойство("Реквизит1С", Реквизит1С);
	Параметры.Свойство("НаборЗначений", НаборЗначений);

	ЗаполнитьСопоставлениеПоХарактеристике();

	Если НаборЗначений Тогда
		Элементы.СопоставленниеЗначенийЗначениеАтрибутаАли.ОграничениеТипа	 = Новый ОписаниеТипов("СписокЗначений");
	Иначе
		Элементы.СопоставленниеЗначенийЗначениеАтрибутаАли.ОграничениеТипа	 = Новый ОписаниеТипов("Строка", ,
			Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));
		МассивСвязей = Новый Массив;
		НоваяСвязь = Новый СвязьПараметраВыбора("Характеристика", "АтрибутАли");
		МассивСвязей.Добавить(НоваяСвязь);
		НоваяСвязь = Новый СвязьПараметраВыбора("Категория", "Категория");
		МассивСвязей.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);
		Элементы.СопоставленниеЗначенийЗначениеАтрибутаАли.СвязиПараметровВыбора = НовыеСвязи;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСопоставленныеЗначения

&НаКлиенте
Процедура СопоставленныеЗначенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СопоставленниеЗначенийЗначениеАтрибутаАлиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("АтрибутАли", АтрибутАли);

	Если НаборЗначений Тогда

		ТекущаяСтрока = Элементы.СопоставленныеЗначения.ТекущиеДанные;
		Если ТипЗнч(ТекущаяСтрока.ЗначениеАтрибутаАли) = Тип("СписокЗначений") Тогда
			ВыбранныеЗначения = ТекущаяСтрока.ЗначениеАтрибутаАли.ВыгрузитьЗначения();
		Иначе
			ВыбранныеЗначения = Новый Массив;
			Если ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеАтрибутаАли) Тогда
				ВыбранныеЗначения.Добавить(ТекущаяСтрока.ЗначениеАтрибутаАли);
			КонецЕсли;
			ТекущаяСтрока.ЗначениеАтрибутаАли = Новый СписокЗначений;
		КонецЕсли;

		СтруктураПараметров.Вставить("ВыбранныеЗначения", ВыбранныеЗначения);

		ОткрытьФорму("Обработка.ИС_АЛИ_ВыгрузкаКарточекТоваров.Форма.ФормаМножественногоВыбораАтрибута", СтруктураПараметров, Элемент, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе

		ОткрытьФорму("Справочник.ИС_АЛИ_ЗначенияАтрибутов.ФормаВыбора", СтруктураПараметров, Элемент, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СопоставленниеЗначенийЗначениеАтрибутаАлиОбработкаВыбора(Элемент, ВыбранноеЗначение,
	СтандартнаяОбработка)

	ТекущаяСтрока = Элементы.СопоставленныеЗначения.ТекущиеДанные;

	СтандартнаяОбработка = Ложь;
	Если НаборЗначений Тогда
		ТекущаяСтрока.ЗначениеАтрибутаАли.ЗагрузитьЗначения(ВыбранноеЗначение);
	Иначе
		ТекущаяСтрока.ЗначениеАтрибутаАли = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СопоставитьАвтоматически(Команда)

	СопоставитьАвтоматическиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СопоставитьПодобные(Команда)
	СопоставитьАвтоматическиНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)

	СохранитьНаСервере();
	Закрыть();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СопоставитьАвтоматическиНаСервере(ПолноеСоответствие = Истина)

	Если ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыНоменклатуры Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыХарактеристики = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыХарактеристики Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры Тогда

		ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");

	Иначе

		ТипРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизит1С, "ТипЗначения");

	КонецЕсли;

	Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(ТипРеквизита) Или Метаданные.Перечисления.Содержит(
		Метаданные.НайтиПоТипу(ТипРеквизита.Типы()[0])) Тогда

		СопоставитьПоЗначениямПримитивногоТипа(ПолноеСоответствие);
	Иначе
		СопоставитьПоЗначениямСвойствОбъектов(ПолноеСоответствие);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()

	НаборЗаписей = РегистрыСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.АтрибутАли.Установить(АтрибутАли);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	Для Каждого стр Из СопоставлениеЗначений Цикл
		Если ЗначениеЗаполнено(стр.ЗначениеАтрибутаАли) Тогда

			Запись = НаборЗаписей.Добавить();
			Запись.Категория 					= Категория;
			Запись.АтрибутАли 					= АтрибутАли;
			Запись.ВидРеквизита1С 				= ВидРеквизита1С;
			Запись.Реквизит1С 					= Реквизит1С;

			Если ТипЗнч(стр.ЗначениеАтрибутаАли) = Тип("СписокЗначений") Тогда
				значение = ЗначенияВСтроку(стр.ЗначениеАтрибутаАли.ВыгрузитьЗначения());
				Если ЗначениеЗаполнено(значение) Тогда
					Запись.ЗначениеАтрибутаАли 	= значение;
				Иначе
					Продолжить;
				КонецЕсли;
			Иначе
				Запись.ЗначениеАтрибутаАли 	= стр.ЗначениеАтрибутаАли;
			КонецЕсли;

			Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(ТипЗнч(стр.ЗначениеВ1С)) Тогда
				Запись.ЗначениеХарактеристики 	= стр.ЗначениеВ1С;
			Иначе
				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(стр.ЗначениеВ1С));
				Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
					Запись.ЗначениеХарактеристики = Строка(стр.ЗначениеВ1С.УникальныйИдентификатор());
				ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
					Запись.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Индекс(стр.ЗначениеВ1С) + 1;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;

	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Категория 			= Категория;
		Запись.АтрибутАли 	= АтрибутАли;
	КонецЕсли;

	НаборЗаписей.Записать(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСопоставлениеПоХарактеристике()

	ТаблицаСоответствий = ИС_АЛИ_Сервер.ТаблицаСоответствийЗначений(Категория, АтрибутАли,
		ВидРеквизита1С, Реквизит1С);
	Для Каждого стр Из ТаблицаСоответствий Цикл

		НоваяСтрока = СопоставлениеЗначений.Добавить();
		НоваяСтрока.ЗначениеВ1С = стр.ЗначениеВ1С;

		Если ЗначениеЗаполнено(стр.ЗначениеАтрибутаАли) Тогда

			Если НаборЗначений Тогда

				Если ТипЗнч(стр.ЗначениеАтрибутаАли) = Тип("Строка") Тогда
					МассивЗначений = ИС_АЛИ_Сервер.ЗначенияАтрибутовАлиИзСтроки(
						стр.ЗначениеАтрибутаАли);
				Иначе
					МассивЗначений = Новый Массив;
					МассивЗначений.Добавить(стр.ЗначениеАтрибутаАли);
				КонецЕсли;

				НоваяСтрока.ЗначениеАтрибутаАли = Новый СписокЗначений;
				НоваяСтрока.ЗначениеАтрибутаАли.ЗагрузитьЗначения(МассивЗначений);

			Иначе

				НоваяСтрока.ЗначениеАтрибутаАли = стр.ЗначениеАтрибутаАли;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	СопоставлениеЗначений.Сортировать("ЗначениеВ1С");

КонецПроцедуры

&НаСервере
Процедура СопоставитьПоЗначениямПримитивногоТипа(ПолноеСоответствие)

	Если ПолноеСоответствие Тогда
		Условие = "ПО вт_СопоставленныеЗначения.ПредставлениеЗначениеВ1С = вт_ЗначенияАли.Наименование";
	Иначе
		Условие = "ПО вт_СопоставленныеЗначения.ПредставлениеЗначениеВ1С Подобно ""%"" + вт_ЗначенияАли.Наименование + ""%""
				  |	ИЛИ вт_ЗначенияАли.Наименование Подобно ""%"" + вт_СопоставленныеЗначения.ПредставлениеЗначениеВ1С + ""%""";
	КонецЕсли;

	ТабЗнач = СопоставлениеЗначений.Выгрузить().Скопировать();
	ТабЗнач.Колонки.Добавить("ПредставлениеЗначениеВ1С", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150,
		ДопустимаяДлина.Переменная)));

	Для Каждого стр Из ТабЗнач Цикл
		Если ТипЗнч(стр.ЗначениеВ1С) = Тип("Строка") Тогда
			стр.ПредставлениеЗначениеВ1С = стр.ЗначениеВ1С;
		Иначе
			стр.ПредставлениеЗначениеВ1С = Формат(стр.ЗначениеВ1С,
				"ЧРД=,; ЧРГ=; ЧГ=0; ДФ=dd.MM.yyyy; БЛ=false; БИ=true");
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АтрибутАли", АтрибутАли);	
	Запрос.УстановитьПараметр("ТабЗнач", ТабЗнач);

	Запрос.Текст = "ВЫБРАТЬ
				   |	ТабЗнач.ЗначениеВ1С КАК ЗначениеВ1С,
				   |	ТабЗнач.ПредставлениеЗначениеВ1С КАК ПредставлениеЗначениеВ1С
				   |ПОМЕСТИТЬ вт_СопоставленныеЗначения
				   |ИЗ
				   |	&ТабЗнач КАК ТабЗнач
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	ИС_АЛИ_ЗначенияАтрибутов.Наименование КАК Наименование,
				   |	ИС_АЛИ_ЗначенияАтрибутов.Ссылка КАК Ссылка
				   |ПОМЕСТИТЬ вт_ЗначенияАли
				   |ИЗ
				   |	Справочник.ИС_АЛИ_ЗначенияАтрибутов КАК ИС_АЛИ_ЗначенияАтрибутов
				   |ГДЕ
				   |	ИС_АЛИ_ЗначенияАтрибутов.Владелец = &АтрибутАли  
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	вт_СопоставленныеЗначения.ЗначениеВ1С КАК ЗначениеВ1С,
				   |	вт_ЗначенияАли.Ссылка КАК СопоставленноеЗначениеАли
				   |ИЗ
				   |	вт_СопоставленныеЗначения КАК вт_СопоставленныеЗначения
				   |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЗначенияАли КАК вт_ЗначенияАли
				   |		" + Условие;
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	СопоставлениеЗначений.Очистить();
	ПредыдущееЗначение = Неопределено;
	Пока Выборка.Следующий() Цикл

		Если ПредыдущееЗначение = Выборка.ЗначениеВ1С Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = СопоставлениеЗначений.Добавить();
		НоваяСтрока.ЗначениеВ1С = Выборка.ЗначениеВ1С;

		Если Не ЗначениеЗаполнено(Выборка.СопоставленноеЗначениеАли) Тогда
			Продолжить;
		КонецЕсли;

		Если НаборЗначений Тогда
			МассивЗначений = Новый Массив;
			МассивЗначений.Добавить(Выборка.СопоставленноеЗначениеАли);
			НоваяСтрока.ЗначениеАтрибутаАли = Новый СписокЗначений;
			НоваяСтрока.ЗначениеАтрибутаАли.ЗагрузитьЗначения(МассивЗначений);
		Иначе
			НоваяСтрока.ЗначениеАтрибутаАли = Выборка.СопоставленноеЗначениеАли;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СопоставитьПоЗначениямСвойствОбъектов(ПолноеСоответствие)

	Если ПолноеСоответствие Тогда
		Условие = "ПО вт_СопоставленныеЗначения.ЗначениеВ1С.Наименование = вт_ЗначенияАли.Наименование";
	Иначе
		Условие = "ПО вт_СопоставленныеЗначения.ЗначениеВ1С.Наименование Подобно ""%"" + вт_ЗначенияАли.Наименование + ""%""
				  |	ИЛИ вт_ЗначенияАли.Наименование Подобно ""%"" + вт_СопоставленныеЗначения.ЗначениеВ1С.Наименование + ""%""";
	КонецЕсли;

	ТабЗнач = СопоставлениеЗначений.Выгрузить();
	Если ТабЗнач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТипЗначения = ТабЗнач[0].ЗначениеВ1С.Метаданные().ПолноеИмя();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АтрибутАли", АтрибутАли);	
	Запрос.УстановитьПараметр("ТабЗнач", ТабЗнач);
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВЫРАЗИТЬ (ТабЗнач.ЗначениеВ1С КАК " + ТипЗначения + ") КАК ЗначениеВ1С
																			|ПОМЕСТИТЬ вт_СопоставленныеЗначения
																			|ИЗ
																			|	&ТабЗнач КАК ТабЗнач
																			|;
																			|
																			|////////////////////////////////////////////////////////////////////////////////
																			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
																			|	ИС_АЛИ_ЗначенияАтрибутов.Наименование КАК Наименование,
																			|	ИС_АЛИ_ЗначенияАтрибутов.Ссылка КАК Ссылка
																			|ПОМЕСТИТЬ вт_ЗначенияАли
																			|ИЗ
																			|	Справочник.ИС_АЛИ_ЗначенияАтрибутов КАК ИС_АЛИ_ЗначенияАтрибутов
																			|ГДЕ
																			|	ИС_АЛИ_ЗначенияАтрибутов.Владелец = &АтрибутАли 
																			|;
																			|
																			|////////////////////////////////////////////////////////////////////////////////
																			|ВЫБРАТЬ
																			|	вт_СопоставленныеЗначения.ЗначениеВ1С КАК ЗначениеВ1С,
																			|	вт_ЗначенияАли.Ссылка КАК СопоставленноеЗначениеАли
																			|ИЗ
																			|	вт_СопоставленныеЗначения КАК вт_СопоставленныеЗначения
																			|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЗначенияАли КАК вт_ЗначенияАли
																			|		" + Условие;
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	СопоставлениеЗначений.Очистить();
	ПредыдущееЗначение = Неопределено;
	Пока Выборка.Следующий() Цикл

		Если ПредыдущееЗначение = Выборка.ЗначениеВ1С Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = СопоставлениеЗначений.Добавить();
		НоваяСтрока.ЗначениеВ1С = Выборка.ЗначениеВ1С;

		Если Не ЗначениеЗаполнено(Выборка.СопоставленноеЗначениеАли) Тогда
			Продолжить;
		КонецЕсли;

		Если НаборЗначений Тогда
			МассивЗначений = Новый Массив;
			МассивЗначений.Добавить(Выборка.СопоставленноеЗначениеАли);
			НоваяСтрока.ЗначениеАтрибутаАли = Новый СписокЗначений;
			НоваяСтрока.ЗначениеАтрибутаАли.ЗагрузитьЗначения(МассивЗначений);
		Иначе
			НоваяСтрока.ЗначениеАтрибутаАли = Выборка.СопоставленноеЗначениеАли;
		КонецЕсли;

		ПредыдущееЗначение = Выборка.Значениев1С;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЗначенияВСтроку(МассивЗначений)

	Результат = "";
	Для Каждого значение Из МассивЗначений Цикл
		Если ЗначениеЗаполнено(значение) Тогда
			Результат = Результат + Строка(значение.УникальныйИдентификатор()) + ";";
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
